//颠倒给定的 32 位无符号整数的二进制位。 
//
// 
//
// 示例 1： 
//
// 输入: 00000010100101000001111010011100
//输出: 00111001011110000010100101000000
//解释: 输入的二进制串 00000010100101000001111010011100 表示无符号整数 43261596，
//     因此返回 964176192，其二进制表示形式为 00111001011110000010100101000000。 
//
// 示例 2： 
//
// 输入：11111111111111111111111111111101
//输出：10111111111111111111111111111111
//解释：输入的二进制串 11111111111111111111111111111101 表示无符号整数 4294967293，
//     因此返回 3221225471 其二进制表示形式为 10111111111111111111111111111111 。 
//
// 
//
// 提示： 
//
// 
// 请注意，在某些语言（如 Java）中，没有无符号整数类型。在这种情况下，输入和输出都将被指定为有符号整数类型，并且不应影响您的实现，因为无论整数是有符号的
//还是无符号的，其内部的二进制表示形式都是相同的。 
// 在 Java 中，编译器使用二进制补码记法来表示有符号整数。因此，在上面的 示例 2 中，输入表示有符号整数 -3，输出表示有符号整数 -10737418
//25。 
// 
//
// 
//
// 进阶: 
//如果多次调用这个函数，你将如何优化你的算法？ 
// Related Topics 位运算 
// 👍 275 👎 0


//leetcode submit region begin(Prohibit modification and deletion)
public class Solution {
    //			解答成功:
    //			执行耗时:1 ms,击败了100.00% 的Java用户
    //			内存消耗:37.8 MB,击败了97.89% 的Java用户
    // you need treat n as an unsigned value
    public int reverseBits(int n) {
        int result = 0;
        if( n > 0 ) {
            for (int i = 32; i > 0; i--) {
                result = (result << 1) + (n % 2);
                n = n >> 1;
            }
        }else if( n < 0){
            n = -n-1;
            for (int i = 31; i > 0 ; i--) {
                result = (result << 1) + ( n % 2 == 0 ? 1 : 0);
                n = n >> 1;
            }
            result = (result << 1) + 1;
        }
        return result;
    }
}
//leetcode submit region end(Prohibit modification and deletion)
