//编写一个算法来判断一个数 n 是不是快乐数。 
//
// 「快乐数」定义为： 
//
// 
// 对于一个正整数，每一次将该数替换为它每个位置上的数字的平方和。
//前N项的平方和为n(n+1)(2n+1)/6
// 然后重复这个过程直到这个数变为 1，也可能是 无限循环 但始终变不到 1。
// 如果 可以变为 1，那么这个数就是快乐数。
//
//
// 如果 n 是快乐数就返回 true ；不是，则返回 false 。
//
// 
//
// 示例 1： 
//
// 
//输入：19
//输出：true
//解释：
//12 + 92 = 82
//82 + 22 = 68
//62 + 82 = 100
//12 + 02 + 02 = 1
// 1
//
// 示例 2： 
//
// 
//输入：n = 2
//输出：false
// 
//
// 
//
// 提示： 
//
// 
// 1 <= n <= 231 - 1 
// 
// Related Topics 哈希表 数学 
// 👍 551 👎 0


//leetcode submit region begin(Prohibit modification and deletion)
class Solution {

    //			解答成功:
    //			执行耗时:1 ms,击败了99.73% 的Java用户
    //			内存消耗:35.3 MB,击败了76.11% 的Java用户
    public boolean isHappy(int n){
        Map<Integer,Integer> map = new HashMap<>();
        while( n != 1 && map.get(n) == null){
            map.put(n,1);
            n = getNextNum( n );
        }
        return n == 1;
    }

    public int getNextNum(int num ) {
        int sum = 0;
        while( num != 0){
            sum += (num % 10) * (num % 10);
            num /= 10;
        }
        return sum;
    }
}
//leetcode submit region end(Prohibit modification and deletion)
